#include <iostream>
#include <queue>

using namespace std;

int main(){

    //deque
    //他のコンテナ同様使えるもの→reverse,

    //----------------------------------------------------------------------------------------------------------//
    //要素を先頭に追加 //末尾に追加 //どちらもO(1)
    deque<char> dq;
    dq.push_front('a');
    dq.push_back('b');

    //先頭、末尾要素を削除
    dq.pop_front();
    dq.pop_back();

    //----------------------------------------------------------------------------------------------------------//

}